In [1]:
import numpy
import pandas

In [2]:
my_dictionary = {"James" : [40, 30, numpy.nan], "Kirk" : [20, numpy.nan, 30], "Lars" : [30,50,40]}

In [3]:
my_data_frame = pandas.DataFrame(my_dictionary)
my_data_frame

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  30.0    40

In [4]:
my_data_frame.dropna()
# drop not avaible = nan olan satırları siler

   James  Kirk  Lars
0   40.0  20.0    30

In [5]:
my_data_frame.dropna(axis=1)
# drop not avaible = nan olan sutunlari siler

   Lars
0    30
1    50
2    40

In [6]:
my_new_dictionary = {"James" : [40, 30, numpy.nan], "Kirk" : [20, numpy.nan, 30], "Lars" : [30,50,40], "Rob" : [45, numpy.nan, numpy.nan]}

In [7]:
my_new_data_frame = pandas.DataFrame(my_new_dictionary)
my_new_data_frame

   James  Kirk  Lars   Rob
0   40.0  20.0    30  45.0
1   30.0   NaN    50   NaN
2    NaN  30.0    40   NaN

In [8]:
my_new_data_frame.dropna(axis=1, thresh=2)
#thresh, 2 veya daha fazla eksik veri varsa siliyor.

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  30.0    40

In [9]:
my_new_data_frame.fillna(20)
#nan'ları dolduruyor.

   James  Kirk  Lars   Rob
0   40.0  20.0    30  45.0
1   30.0  20.0    50  20.0
2   20.0  30.0    40  20.0

groupBy

In [10]:
salary_dict = {"Programming Language": ["Python", "Python", "Python", "Java", "Java", "Swift"], "Name" : ["A", "B", "C", "D", "E", "F"], "Salary" : [100, 90, 80, 70, 60, 50]}

In [11]:
salary_frame = pandas.DataFrame(salary_dict)
salary_frame

  Programming Language Name  Salary
0               Python    A     100
1               Python    B      90
2               Python    C      80
3                 Java    D      70
4                 Java    E      60
5                Swift    F      50

In [12]:
salary_frame.groupby("Programming Language")
#bize grup objesi verdi

In [13]:
group_object = salary_frame.groupby("Programming Language")

In [14]:
group_object.count()

                      Name  Salary
Programming Language
Java                     2       2
Python                   3       3
Swift                    1       1

In [15]:
group_object.mean("Salary")

                      Salary
Programming Language
Java                    65.0
Python                  90.0
Swift                   50.0

In [16]:
group_object.min()
#yanlış buluyor gibi duruyor ama name'e göre de bakıyor

                     Name  Salary
Programming Language
Java                    D      60
Python                  A      80
Swift                   F      50

In [17]:
group_object.max()

                     Name  Salary
Programming Language
Java                    E      70
Python                  C     100
Swift                   F      50

In [18]:
group_object.min("salary")

                      Salary
Programming Language
Java                      60
Python                    80
Swift                     50

In [19]:
help(group_object.min)

Help on method min in module pandas.core.groupby.groupby:

min(numeric_only: 'bool' = False, min_count: 'int' = -1, engine: "Literal['cython', 'numba'] | None" = None, engine_kwargs: 'dict[str, bool] | None' = None) method of pandas.core.groupby.generic.DataFrameGroupBy instance
    Compute min of group values.

    Parameters
    ----------
    numeric_only : bool, default False
        Include only float, int, boolean columns.

        .. versionchanged:: 2.0.0

            numeric_only no longer accepts ``None``.

    min_count : int, default -1
        The required number of valid values to perform the operation. If fewer
        than ``min_count`` non-NA values are present the result will be NA.

    engine : str, default None None
        * ``'cython'`` : Runs rolling apply through C-extensions from cython.
        * ``'numba'`` : Runs rolling apply through JIT compiled code from numba.
            Only available when ``raw`` is set to ``True``.
        * ``None`` : Defaults to ``'cython'`` or globally setting ``compute.use_numba``

    engine_kwargs : dict, default None None
        * For ``'cython'`` engine, there are no accepted ``engine_kwargs``
        * For ``'numba'`` engine, the engine can accept ``nopython``, ``nogil``
            and ``parallel`` dictionary keys. The values must either be ``True`` or
            ``False``. The default ``engine_kwargs`` for the ``'numba'`` engine is
            ``{'nopython': True, 'nogil': False, 'parallel': False}`` and will be
            applied to both the ``func`` and the ``apply`` groupby aggregation.

    Returns
    -------
    Series or DataFrame
        Computed min of values within each group.

    Examples
    --------
    For SeriesGroupBy:

    >>> lst = ['a', 'a', 'b', 'b']
    >>> ser = pd.Series([1, 2, 3, 4], index=lst)
    >>> ser
    a    1
    a    2
    b    3
    b    4
    dtype: int64
    >>> ser.groupby(level=0).min()
    a    1
    b    3
    dtype: int64

    For DataFrameGroupBy:

    >>> data = [[1, 8, 2], [1, 2, 5], [2, 5, 8], [2, 6, 9]]
    >>> df = pd.DataFrame(data, columns=["a", "b", "c"],
    ...                   index=["tiger", "leopard", "cheetah", "lion"])
    >>> df
              a  b  c
      tiger   1  8  2
    leopard   1  2  5
    cheetah   2  5  8
       lion   2  6  9
    >>> df.groupby("a").min()
        b  c
    a
    1   2  2
    2   5  8

In [20]:
group_object.min(numeric_only=True)
#help ten oku

                      Salary
Programming Language
Java                      60
Python                    80
Swift                     50

In [21]:
group_object.describe()

                     Salary
                      count  mean        std   min   25%   50%   75%    max
Programming Language
Java                    2.0  65.0   7.071068  60.0  62.5  65.0  67.5   70.0
Python                  3.0  90.0  10.000000  80.0  85.0  90.0  95.0  100.0
Swift                   1.0  50.0        NaN  50.0  50.0  50.0  50.0   50.0

In [22]:
my_dict1 = {"Name" : ["Alperen", "Baturalp","Cafer","Deniz"],
            "Sports": ["Basketball", "Football", "Tennis", "Running"],
            "Calories": [100, 200, 300, 400]
            }

In [23]:
my_frame1 = pandas.DataFrame(my_dict1)
my_frame1

       Name      Sports  Calories
0   Alperen  Basketball       100
1  Baturalp    Football       200
2     Cafer      Tennis       300
3     Deniz     Running       400

In [24]:
my_dict2 = {"Name" : ["Emirhan", "Faruk","Gökberk","Hasan"],
            "Sports": ["Basketball", "Football", "Tennis", "Running"],
            "Calories": [200, 50, 330, 460]
            }

In [25]:
my_frame2 = pandas.DataFrame(my_dict2)
my_frame2

      Name      Sports  Calories
0  Emirhan  Basketball       200
1    Faruk    Football        50
2  Gökberk      Tennis       330
3    Hasan     Running       460

In [26]:
my_dict3 = {"Name" : ["Isaac", "John","Kevin","Lemar"],
            "Sports": ["Basketball", "Football", "Tennis", "Running"],
            "Calories": [200, 50, 330, 460]
            }

In [27]:
my_frame3 = pandas.DataFrame(my_dict3)
my_frame3

    Name      Sports  Calories
0  Isaac  Basketball       200
1   John    Football        50
2  Kevin      Tennis       330
3  Lemar     Running       460

In [28]:
pandas.concat([my_frame1, my_frame2, my_frame3])
#concatenation = birleştirme

       Name      Sports  Calories
0   Alperen  Basketball       100
1  Baturalp    Football       200
2     Cafer      Tennis       300
3     Deniz     Running       400
0   Emirhan  Basketball       200
1     Faruk    Football        50
2   Gökberk      Tennis       330
3     Hasan     Running       460
0     Isaac  Basketball       200
1      John    Football        50
2     Kevin      Tennis       330
3     Lemar     Running       460

In [29]:
pandas.merge(my_frame1, my_frame2, on="Sports")
#merge = ortak verilerden yola çıkarak yeni tablo oluşturuyor

     Name_x      Sports  Calories_x   Name_y  Calories_y
0   Alperen  Basketball         100  Emirhan         200
1  Baturalp    Football         200    Faruk          50
2     Cafer      Tennis         300  Gökberk         330
3     Deniz     Running         400    Hasan         460

In [30]:
new_salary_frame = pandas.DataFrame({"Name" : ["James", "Kirk", "Lars"], "Salary" : [10,20,30], "Age" : [60,65,70]})

In [31]:
new_salary_frame

    Name  Salary  Age
0  James      10   60
1   Kirk      20   65
2   Lars      30   70

In [32]:
new_salary_frame["Name"]
#böyle yazarsak bize series getiriyor

0    James
1     Kirk
2     Lars
Name: Name, dtype: object

In [33]:
new_salary_frame["Name"].unique()
#benzersiz stringleri gösteriyor

array(['James', 'Kirk', 'Lars'], dtype=object)

In [34]:
new_salary_frame["Name"].nunique()

3

In [35]:
def grossToNet(salary):
    return salary * 0.66

In [36]:
new_salary_frame["Salary"].apply(grossToNet)

0     6.6
1    13.2
2    19.8
Name: Salary, dtype: float64